![png](booksERD.png)

## Import Packages

In [79]:
import pymysql
pymysql.install_as_MySQLdb()

In [80]:
from sqlalchemy import create_engine
import pandas as pd
from urllib.parse import quote_plus
from sqlalchemy import text

## Create Engine and Set Connection

In [81]:
# Create the sqlalchemy engine and connection
username = "root"
password = quote_plus("Vis688131!") 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "Books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

### Test connection

In [113]:
q = """SELECT * FROM books;"""
pd.read_sql(q, conn)

   id                 title          created_at          updated_at  author_id
0   1           The Shining 2023-10-03 16:43:24 2023-10-03 16:43:24          1
1   2                    It 2023-10-03 16:43:24 2023-10-03 16:43:24          1
2   3      The Great Gatsby 2023-10-03 16:43:24 2023-10-03 16:43:24          2
3   4  The Call of the Wild 2023-10-03 16:43:24 2023-10-03 16:43:24          3
4   5   Pride and Prejudice 2023-10-03 16:43:24 2023-10-03 16:43:24          4
5   6          Frankenstein 2023-10-03 16:43:24 2023-10-03 16:43:24          5

## Set Dataframes from CSV files

In [114]:
users = pd.read_csv('RawData/users  - users.csv')

In [84]:
favorites = pd.read_csv('RawData/favorites - favorites.csv')

In [85]:
authors = pd.read_csv("RawData/users  - users.csv")

In [86]:
books = pd.read_csv('RawData/books - books.csv')

## Edit Users to match names and dtypes between SQL and DF

In [87]:
q = '''DESCRIBE Users;'''
describe = pd.read_sql(q, conn)
describe

,Field,Type,Null,Key,Default,Extra
0,id,int,NO,PRI,None,auto_increment
1,first_name,varchar(45),YES,,None,
2,last_name,varchar(45),YES,,None,
3,email,varchar(45),YES,,None,
4,created_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,updated_at,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [88]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

## Edit Authors to match names and dtypes between SQL and DF

In [89]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

         Field         Type Null  Key Default           Extra
0           id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

In [90]:
authors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

## Merge names into one column, and remove email.

In [91]:
authors["author_name"] = authors["first_name"].str.cat(authors["last_name"], sep="-")

In [92]:
authors = authors.drop(columns='first_name')

In [93]:
authors = authors.drop(columns='last_name')

In [106]:
authors = authors.drop(columns='email')

In [94]:
authors.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           3 non-null      int64
 1   email        3 non-null      object
 2   author_name  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

## Edit Books to match names and dtypes between SQL and DF

In [95]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key            Default              Extra
0          id          int   NO  PRI               None     auto_increment
1       title  varchar(45)  YES                    None
2  created_at     datetime  YES       CURRENT_TIMESTAMP  DEFAULT_GENERATED
3  updated_at     datetime  YES       CURRENT_TIMESTAMP  DEFAULT_GENERATED
4   author_id          int   NO                    None

In [96]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

## Edit Favorites to match names and dtypes between SQL and DF

In [97]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, conn)
describe

     Field Type Null Key Default Extra
0  book_id  int   NO        None
1  user_id  int   NO        None

In [98]:
favorites.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

## Insterting Data into SQL tables

In [108]:
favorites.to_sql("favorites",conn,index=False, if_exists='append')

7

In [107]:
authors.to_sql("authors",conn,index=False, if_exists='append')

3

In [104]:
users.to_sql("users",conn,index=False, if_exists='append')

3

In [99]:
books.to_sql("books",conn,index=False, if_exists='append')

6

## Testing nothing has changed names

In [109]:
q = """SHOW TABLES """
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Testing our data has been fit into the SQL tables

In [110]:
q = """SELECT * FROM users;"""
pd.read_sql(q, conn)

,id,first_name,last_name,email,created_at,updated_at
0,1,John,Doe,JD@books.com,2023-10-03 16:43:41,2023-10-03 16:43:41
1,2,Robin,Smith,Robin@books.com,2023-10-03 16:43:41,2023-10-03 16:43:41
2,3,Gloria,Rodriguez,grodriquez@books.com,2023-10-03 16:43:41,2023-10-03 16:43:41

In [111]:
q = """SELECT * FROM books;"""
pd.read_sql(q, conn)

   id                 title          created_at          updated_at  author_id
0   1           The Shining 2023-10-03 16:43:24 2023-10-03 16:43:24          1
1   2                    It 2023-10-03 16:43:24 2023-10-03 16:43:24          1
2   3      The Great Gatsby 2023-10-03 16:43:24 2023-10-03 16:43:24          2
3   4  The Call of the Wild 2023-10-03 16:43:24 2023-10-03 16:43:24          3
4   5   Pride and Prejudice 2023-10-03 16:43:24 2023-10-03 16:43:24          4
5   6          Frankenstein 2023-10-03 16:43:24 2023-10-03 16:43:24          5

## Listing John Doe's favorite boooks

In [112]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q,conn)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1